### 공공데이터

In [23]:
import pandas as pd

In [35]:
path = r'C:\Users\user\Desktop\새 폴더\앙.csv'
df = pd.read_csv(path,encoding='cp949')

In [36]:
df.head()

      학번  이름  java    c  python    유니티
0  30301  김1   NaN  NaN     NaN    NaN
1  30302  김2   5.0  2.0    23.0    6.0
2  30303  김3  10.0  3.0    21.0    5.0
3  30304  김4  15.0  3.0     4.0  342.0
4  30305  김5  20.0  4.0    67.0   52.0

In [37]:
df.tail()

       학번   이름   java     c  python   유니티
17  30318  김18   85.0  23.0     4.0  34.0
18  30319  김19   90.0   3.0   214.0  41.0
19  30320  김20  100.0   4.0   213.0   1.0
20  30321  김21  100.0   1.0    21.0  34.0
21  30322  김22  101.0   2.0    41.0   5.0

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 6 columns):
학번        22 non-null int64
이름        22 non-null object
java      20 non-null float64
c         20 non-null float64
python    20 non-null float64
유니티       20 non-null float64
dtypes: float64(4), int64(1), object(1)
memory usage: 1.2+ KB

In [39]:
df.shape

(22, 6)

In [40]:
df.sample()

       학번   이름   java    c  python   유니티
20  30321  김21  100.0  1.0    21.0  34.0

In [41]:
df.columns

Index(['학번', '이름', 'java', 'c', 'python', '유니티'], dtype='object')

In [42]:
df.dtypes

학번          int64
이름         object
java      float64
c         float64
python    float64
유니티       float64
dtype: object

In [44]:
df.isnull()

       학번     이름   java      c  python    유니티
0   False  False   True   True    True   True
1   False  False  False  False   False  False
2   False  False  False  False   False  False
3   False  False  False  False   False  False
4   False  False  False  False   False  False
5   False  False  False  False   False  False
6   False  False  False  False   False  False
7   False  False  False  False   False  False
8   False  False   True   True    True   True
9   False  False  False  False   False  False
10  False  False  False  False   False  False
11  False  False  False  False   False  False
12  False  False  False  False   False  False
13  False  False  False  False   False  False
14  False  False  False  False   False  False
15  False  False  False  False   False  False
16  False  False  False  False   False  False
17  False  False  False  False   False  False
18  False  False  False  False   False  False
19  False  False  False  False   False  False
20  False  False  False  False   False  False
21  False  False  False  False   False  False

In [53]:
path= r'C:\Users\user\Desktop\새 폴더\오.csv'
df = pd.read_csv(path,encoding='cp949')

In [54]:
null_count=df.isnull().sum()

In [50]:
df_null_count = null_count.reset_index()

In [55]:
df_null_count.columns=['메뉴','결측']

In [86]:
df_null_count_3=df_null_count.sort_values(by='결측',ascending=False).head(3)

In [87]:
drop_columns = df_null_count_3['메뉴']

In [61]:
drop_columns.to_list()

['도로종류', '시간대', '사고건수']

In [63]:
df[drop_columns]

    도로종류      시간대  사고건수
0   일반국도  00시-02시   878
1   일반국도  02시-04시   535
2   일반국도  04시-06시   554
3   일반국도  06시-08시  1262
4   일반국도  08시-10시  1757
..   ...      ...   ...
79    기타  14시-16시  1943
80    기타  16시-18시  2242
81    기타  18시-20시  2228
82    기타  20시-22시  1610
83    기타  22시-24시  1256

[84 rows x 3 columns]

In [72]:
print(df.shape)

(84, 5)

In [66]:
print(df.shape)

(84, 5)

In [67]:
df.head()

   사망자수  부상자수   중상    경상  부상신고
0    87  1428  481   894    53
1    51   820  273   502    45
2    67   876  355   479    42
3    85  2180  727  1374    79
4    71  3175  993  2062   120

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84 entries, 0 to 83
Data columns (total 5 columns):
사망자수    84 non-null int64
부상자수    84 non-null int64
중상      84 non-null int64
경상      84 non-null int64
부상신고    84 non-null int64
dtypes: int64(5)
memory usage: 3.4 KB